In [2]:
import pandas as pd
import numpy as np

# Creating a fake dataset with "Dirty" data (Missing values)
data = {
    "name": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "salary": [50000, 60000, np.nan, 45000, 70000],  # NaN = Missing (Not a Number)
    "department": ["HR", "IT", "IT", np.nan, "HR"],
    "age": [25, 30, 35, 22, np.nan]
}

df = pd.DataFrame(data)
df.to_csv("employees.csv", index=False)

print("File 'employees.csv' created!")

File 'employees.csv' created!

In [3]:
df = pd.read_csv("employees.csv")
df

      name   salary department   age
0    Alice  50000.0         HR  25.0
1      Bob  60000.0         IT  30.0
2  Charlie      NaN         IT  35.0
3    David  45000.0        NaN  22.0
4      Eve  70000.0         HR   NaN

In [4]:
df.isnull()

    name  salary  department    age
0  False   False       False  False
1  False   False       False  False
2  False    True       False  False
3  False   False        True  False
4  False   False       False   True

In [5]:
df.isnull().sum()

name          0
salary        1
department    1
age           1
dtype: int64

In [6]:
df_clean = df.dropna()

In [7]:
df

      name   salary department   age
0    Alice  50000.0         HR  25.0
1      Bob  60000.0         IT  30.0
2  Charlie      NaN         IT  35.0
3    David  45000.0        NaN  22.0
4      Eve  70000.0         HR   NaN